[Killed] BlockStatement
src/calculator.ts:6:18
 
   result = 0;
 
-  add(x: number) {
-    this.result += x + this.magicService.getMagicNumber();
-  }
+  add(x: number) {}
 
   divide(x: number) {
killedBy: Calculator adds numbers
statusReason: expected +0 to be 627 // Object.is equality

[Killed] ArithmeticOperator
src/calculator.ts:7:20
   result = 0;
 
   add(x: number) {
-    this.result += x + this.magicService.getMagicNumber();
+    this.result += x - this.magicService.getMagicNumber();
   }
 
killedBy: Calculator adds numbers
statusReason: expected -573 to be 627 // Object.is equality

[Killed] AssignmentOperator
src/calculator.ts:7:5
   result = 0;
 
   add(x: number) {
-    this.result += x + this.magicService.getMagicNumber();
+    this.result -= x + this.magicService.getMagicNumber();
   }
 
killedBy: Calculator adds numbers
statusReason: expected -627 to be 627 // Object.is equality

[Killed] BlockStatement
src/calculator.ts:10:21
     this.result += x + this.magicService.getMagicNumber();
   }
 
-  divide(x: number) {
-    if (x === 0) {
-      //   throw "flauwekul";
-      throw new Error("flauwekul");
-    }
-
-    this.result /= x;
-  }
+  divide(x: number) {}
 }
 
killedBy: Calculator dividing numbers divides numbers
statusReason: expected 9 to be 3 // Object.is equality

[Killed] EqualityOperator
src/calculator.ts:11:9
   }
 
   divide(x: number) {
-    if (x === 0) {
+    if (x !== 0) {
       //   throw "flauwekul";
       throw new Error("flauwekul");
killedBy: Calculator dividing numbers divides numbers
statusReason: flauwekul

[Killed] BlockStatement
src/calculator.ts:11:18
   }
 
   divide(x: number) {
-    if (x === 0) {
-      //   throw "flauwekul";
-      throw new Error("flauwekul");
-    }
+    if (x === 0) {}
 
     this.result /= x;
killedBy: Calculator dividing numbers does not divide by zero
statusReason: expected [Function act] to throw an error

[Killed] AssignmentOperator
src/calculator.ts:16:5
       throw new Error("flauwekul");
     }
 
-    this.result /= x;
+    this.result *= x;
   }
 }
killedBy: Calculator dividing numbers divides numbers
statusReason: expected 27 to be 3 // Object.is equality

[NoCoverage] BlockStatement
src/calculator.ts:21:20
 }
 
 export class MagicService {
-  getMagicNumber() {
-    return 42;
-  }
+  getMagicNumber() {}
 }
 
